### Data definition
This section shows you how to manage the most important database objects including databases and tables.

    CREATE DATABASE – show you how to create a new database in an SQL Server instance using the CREATE DATABASE statement and SQL Server Management Studio.
    DROP DATABASE – learn how to delete existing databases.
    CREATE SCHEMA – describe how to create a new schema in a database.
    ALTER SCHEMA – show how to transfer a securable from one schema to another within the same database.
    DROP SCHEMA – learn how to delete a schema from a database.
    CREATE TABLE – walk you through the steps of creating a new table in a specific schema of a database.
    Identity column – learn how to use the IDENTITY property to create the identity column for a table.
    Sequence – describe how to generate a sequence of numeric values based on a specification.
    ALTER TABLE ADD column – show you how to add one or more columns to an existing table
    ALTER TABLE ALTER COLUMN – show you how to change the definition of existing columns in a table.
    ALTER TABLE DROP COLUMN – learn how to drop one or more columns from a table.
    Computed columns – how to use the computed columns to reuse the calculation logic in multiple queries.
    DROP TABLE – show you how to delete tables from the database.
    TRUNCATE TABLE – delete all data from a table faster and more efficiently.
    SELECT INTO – learn how to create a table and insert data from a query into it.
    Rename a table –  walk you through the process of renaming a table to a new one.
    Temporary tables – introduce you to the temporary tables for storing temporary immediate data in stored procedures or database sessions.
    Synonym – explain the synonym and show you how to create synonyms for database objects.

In [1]:
import pyodbc
import os
import pandas as pd

#Check if drivers are installed
#[x for x in pyodbc.drivers() if x.startswith("Microsoft Access Driver")]

# Define the connection string
conn_str = (
    r'DRIVER={ODBC Driver 17 for SQL Server};'
    r'SERVER=localhost;'
    #r'DATABASE=BikeStores;'
    r'Trusted_Connection=yes;'
)

# Establish the connection
conn = pyodbc.connect(conn_str)

# Create a cursor
cursor = conn.cursor()

In [2]:
# execute a query
cursor.execute('''
SELECT 
    name
FROM 
    master.sys.databases
ORDER BY 
    name;
''')

# Fetch all rows from the executed query
rows = cursor.fetchall()

# Get the column names
columns = [column[0] for column in cursor.description]

# Convert the rows into a list of dictionaries
data = [dict(zip(columns, row)) for row in rows]

# Create a DataFrame from the list of dictionaries
df = pd.DataFrame(data)
df.head(10)

                   name
0  AdventureWorksDW2019
1  AdventureWorksLT2022
2            BikeStores
3                    hr
4                master
5                 model
6                  msdb
7              sampleDb
8                tempdb

create a sample db on mssql server and list it below

In [3]:
# execute a query
cursor.execute('''
SELECT 
    name
FROM 
    master.sys.databases
ORDER BY 
    name;
''')

# Fetch all rows from the executed query
rows = cursor.fetchall()

# Get the column names
columns = [column[0] for column in cursor.description]
/
# Convert the rows into a list of dictionaries
data = [dict(zip(columns, row)) for row in rows]

# Create a DataFrame from the list of dictionaries
df = pd.DataFrame(data)
df.head(10)

                   name
0  AdventureWorksDW2019
1  AdventureWorksLT2022
2            BikeStores
3                    hr
4                master
5                 model
6                  msdb
7              sampleDb
8                tempdb

In [4]:
import pyodbc
import os
import pandas as pd

#Check if drivers are installed
#[x for x in pyodbc.drivers() if x.startswith("Microsoft Access Driver")]

# Define the connection string
conn_str = (
    r'DRIVER={ODBC Driver 17 for SQL Server};'
    r'SERVER=localhost;'
    #r'DATABASE=sampleDb;'
    r'Trusted_Connection=yes;'
)

# Establish the connection
conn = pyodbc.connect(conn_str, autocommit=True) # To drop database or create database, set autocommit to true

# Create a cursor
cursor = conn.cursor()

In [5]:


# execute a query
cursor.execute('''
DROP DATABASE IF EXISTS sampleDb;
''')

In [6]:
# execute a query
cursor.execute('''
SELECT 
    name
FROM 
    master.sys.databases
ORDER BY 
    name;
''')

# Fetch all rows from the executed query
rows = cursor.fetchall()

# Get the column names
columns = [column[0] for column in cursor.description]
/
# Convert the rows into a list of dictionaries
data = [dict(zip(columns, row)) for row in rows]

# Create a DataFrame from the list of dictionaries
df = pd.DataFrame(data)
df.head(10)

                   name
0  AdventureWorksDW2019
1  AdventureWorksLT2022
2            BikeStores
3                    hr
4                master
5                 model
6                  msdb
7                tempdb

In [7]:
conn.close()

In [9]:
conn.closed

True

### CREATE & DROP SCHEMA

A schema is a collection of database objects including tables, views, triggers, stored procedures, indexes, etc. A schema is associated with a username which is known as the schema owner, who is the owner of the logically related database objects.

A schema always belongs to one database. On the other hand, a database may have one or multiple schemas. 

For example, in our BikeStores sample database, we have two schemas: sales and production. An object within a schema is qualified using the schema_name.object_name format like sales.orders. Two tables in two schemas can share the same name so you may have hr.employees and sales.employees.

In [10]:
import pyodbc
import os
import pandas as pd

#Check if drivers are installed
#[x for x in pyodbc.drivers() if x.startswith("Microsoft Access Driver")]

# Define the connection string
conn_str = (
    r'DRIVER={ODBC Driver 17 for SQL Server};'
    r'SERVER=localhost;'
    #r'DATABASE=sampleDb;'
    r'Trusted_Connection=yes;'
)

# Establish the connection
conn = pyodbc.connect(conn_str, autocommit=True) # To drop database or create database, set autocommit to true

# Create a cursor
cursor = conn.cursor()

In [12]:
cursor.execute('''
CREATE SCHEMA logistics;
''')

In [13]:
cursor.execute('''
CREATE TABLE logistics.deliveries
(
    order_id        INT
    PRIMARY KEY, 
    delivery_date   DATE NOT NULL, 
    delivery_status TINYINT NOT NULL
);
''')

In [17]:
cursor.execute('''SELECT 
    s.name AS schema_name, 
    u.name AS schema_owner
FROM 
    sys.schemas s
INNER JOIN sys.sysusers u ON u.uid = s.principal_id
ORDER BY 
    s.name;
 ''')


# Fetch all rows from the executed query
rows = cursor.fetchall()

# Get the column names
columns = [column[0] for column in cursor.description]
/
# Convert the rows into a list of dictionaries
data = [dict(zip(columns, row)) for row in rows]

# Create a DataFrame from the list of dictionaries
df = pd.DataFrame(data)
df.head(50)

           schema_name        schema_owner
0       db_accessadmin      db_accessadmin
1    db_backupoperator   db_backupoperator
2        db_datareader       db_datareader
3        db_datawriter       db_datawriter
4          db_ddladmin         db_ddladmin
5    db_denydatareader   db_denydatareader
6    db_denydatawriter   db_denydatawriter
7             db_owner            db_owner
8     db_securityadmin    db_securityadmin
9                  dbo                 dbo
10               guest               guest
11  INFORMATION_SCHEMA  INFORMATION_SCHEMA
12           logistics                 dbo
13          production                 dbo
14               sales                 dbo
15                 sys                 sys

In [14]:
cursor.execute('''
DROP SCHEMA logistics;
''')

ProgrammingError: ('42000', "[42000] [Microsoft][ODBC Driver 17 for SQL Server][SQL Server]Cannot drop schema 'logistics' because it is being referenced by object 'deliveries'. (3729) (SQLExecDirectW)")

In [18]:
cursor.execute('''
DROP TABLE logistics.deliveries;
''')

In [19]:
cursor.execute('''
DROP SCHEMA logistics;
''')

In [20]:
conn.close()

In [21]:
conn.closed

True

### CREATE TABLE

In [22]:
import pyodbc
import os
import pandas as pd

#Check if drivers are installed
#[x for x in pyodbc.drivers() if x.startswith("Microsoft Access Driver")]

# Define the connection string
conn_str = (
    r'DRIVER={ODBC Driver 17 for SQL Server};'
    r'SERVER=localhost;'
    r'DATABASE=BikeStores;'
    r'Trusted_Connection=yes;'
)

# Establish the connection
conn = pyodbc.connect(conn_str, autocommit=True) # To drop database or create database, set autocommit to true

# Create a cursor
cursor = conn.cursor()

In [23]:
cursor.execute('''
CREATE TABLE sales.visits (
    visit_id INT PRIMARY KEY IDENTITY (1, 1),
    first_name VARCHAR (50) NOT NULL,
    last_name VARCHAR (50) NOT NULL,
    visited_at DATETIME,
    phone VARCHAR(20),
    store_id INT NOT NULL,
    FOREIGN KEY (store_id) REFERENCES sales.stores (store_id)
);
''')

First, specify the name of the database in which the table is created. The database_name must be the name of an existing database. If you don’t specify it, the database_name defaults to the current database.

Second, specify the schema to which the new table belongs.

Third, specify the name of the new table.

Fourth, each table should have a primary key which consists of one or more columns. Typically, you list the primary key columns first and then other columns. If the primary key contains only one column, you can use the PRIMARY KEY keywords after the column name. If the primary key consists of two or more columns, you need to specify the PRIMARY KEY constraint as a table constraint. Each column has an associated data type specified after its name in the statement. A column may have one or more column constraints such as NOT NULL and UNIQUE.

Fifth, a table may have some constraints specified in the table constraints section such as FOREIGN KEY, PRIMARY KEY, UNIQUE and CHECK.

In [24]:
cursor.execute('''
ALTER TABLE sales.visits 
ADD description VARCHAR (255) NOT NULL;
''')

In [26]:
cursor.execute('''
ALTER TABLE sales.visits 
    ADD 
        amount DECIMAL (10, 2) NOT NULL,
        customer_name VARCHAR (50) NOT NULL;
''')

In [32]:
cursor.execute('''
ALTER TABLE sales.visits 
    DROP COLUMN amount 
        
''')

In [38]:
conn.close()

### DROP TABLE

In [39]:
import pyodbc
import os
import pandas as pd

#Check if drivers are installed
#[x for x in pyodbc.drivers() if x.startswith("Microsoft Access Driver")]

# Define the connection string
conn_str = (
    r'DRIVER={ODBC Driver 17 for SQL Server};'
    r'SERVER=localhost;'
    r'DATABASE=BikeStores;'
    r'Trusted_Connection=yes;'
)

# Establish the connection
conn = pyodbc.connect(conn_str, autocommit=True) # To drop database or create database, set autocommit to true

# Create a cursor
cursor = conn.cursor()

In [40]:
cursor.execute('''
DROP TABLE sales.visits;    
''')

In [41]:
cursor.execute(''' SELECT 
    TABLE_NAME
FROM 
    INFORMATION_SCHEMA.TABLES
WHERE 
    TABLE_TYPE = 'BASE TABLE';
    ''')



# Fetch all rows from the executed query
rows = cursor.fetchall()

# Get the column names
columns = [column[0] for column in cursor.description]
/
# Convert the rows into a list of dictionaries
data = [dict(zip(columns, row)) for row in rows]

# Create a DataFrame from the list of dictionaries
df = pd.DataFrame(data)
df.head(50)

       TABLE_NAME
0      categories
1          brands
2        products
3       customers
4          stores
5          staffs
6          orders
7     order_items
8          stocks
9       feedbacks
10  sales_summary

### TRUNCATE TABLE

The TRUNCATE TABLE has the following advantages over the DELETE statement:

1) Use less transaction log
The DELETE statement removes rows one at a time and inserts an entry in the transaction log for each removed row. On the other hand, the TRUNCATE TABLE statement deletes the data by deallocating the data pages used to store the table data and inserts only the page deallocations in the transaction logs.

2) Use fewer locks
When the DELETE statement is executed using a row lock, each row in the table is locked for removal. The TRUNCATE TABLE locks the table and pages, not each row.

3) Identity reset
If the table to be truncated has an identity column, the counter for that column is reset to the seed value when data is deleted by the TRUNCATE TABLE statement but not the DELETE statement.

In [42]:
cursor.execute('''
CREATE TABLE sales.customer_groups (
    group_id INT PRIMARY KEY IDENTITY,
    group_name VARCHAR (50) NOT NULL
);

INSERT INTO sales.customer_groups (group_name)
VALUES
    ('Intercompany'),
    ('Third Party'),
    ('One time');
'''
)

cursor.execute('''
INSERT INTO sales.customer_groups (group_name)
VALUES
    ('Intercompany'),
    ('Third Party'),
    ('One time');   

TRUNCATE TABLE sales.customer_groups;
''')

In [43]:

# Fetch all rows from the executed query
rows = cursor.fetchall()

# Get the column names
columns = [column[0] for column in cursor.description]
/
# Convert the rows into a list of dictionaries
data = [dict(zip(columns, row)) for row in rows]

# Create a DataFrame from the list of dictionaries
df = pd.DataFrame(data)
df.head(50)

ProgrammingError: No results.  Previous SQL was not a query.